Autodesk.Revit.DB.FailureMessageAccessor.ShouldMergeWithMessage(Autodesk.Revit.DB.FailureMessageAccessor)
Checks if the FailureMessage should be merged with the other FailureMessage for better user experience.
Remarks:
Messages should be merged if all user-visible information except failing elements is the same,
failure resolution types are the same and merging lists of failing elements keeps message text applicable to all of them equally.
Method is used by the Revit UI to display multiple messages as one.
Returns:
True if messages should be merged
Throws Autodesk.Revit.Exceptions.ArgumentException:
messageToMergeWith has not been properly initialized.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailureMessageAccessor has not been properly initialized.
Since:
2011

Autodesk.Revit.DB.FailureMessageAccessor.CloneFailureMessage
Creates a copy of the FailureMessage.
Returns:
Copy of the FailureMesassge.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailureMessageAccessor has not been properly initialized.
Since:
2011

Autodesk.Revit.DB.FailureMessageAccessor.GetCurrentResolutionType
Retrieves the type of resolution to be used to resolve the failure.
Remarks:
If the current resolution type was never set for the failure, FailureResolutionType::Default is returned.
Returns:
The type of failure resolution to be used to resolve the failure.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailureMessageAccessor has not been properly initialized.
-or-
This FailureMessageAccessor does not have any resolutions.
Since:
2011

Autodesk.Revit.DB.FailureMessageAccessor.SetCurrentResolutionType(Autodesk.Revit.DB.FailureResolutionType)
Sets the type of a resolution to be used to resolve the failure.
Remarks:
When FailuresAccessor is used to resolve failures, it will execute resolutions based on current resolution type.
If no current resolution type is set, the default resolution type will be used.
Setting is performed on the FailureMessageAccessor object itself, so if there are several accessors issued
for the same FailureMessage, setting of the resolution type performed on one of them does not impact the others.
resolutionType:
The type of failure resolution to be used to resolve the failure.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This FailureMessageAccessor has no resolution of resolutionType.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailureMessageAccessor has not been properly initialized.
-or-
This FailureMessageAccessor does not have any resolutions.
Since:
2011

Autodesk.Revit.DB.FailureMessageAccessor.GetAdditionalElementIds
Retrieves Ids of Elements that have not caused the failure but are related to it
Checks if the failure has resolution of a given resolution type.
Returns:
Ids of Elements related to the failure
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailureMessageAccessor has not been properly initialized.
Since:
2011

Autodesk.Revit.DB.FailureMessageAccessor.GetNumberOfResolutions
Retrieves number of resolutions that can be used to resolve failure.
Remarks:
If number of resolutions is zero, the failure cannot be resolved. If severity of the failure is Warning,
it can be deleted. Otherwise, the only option is to cancel current operation and roll back the transaction
Returns:
Number of resolutions that can be used to resolve failure
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailureMessageAccessor has not been properly initialized.
Since:
2011

Autodesk.Revit.DB.FailureMessageAccessor.GetFailingElementIds
Retrieves Ids of Elements that have caused the failure.
Returns:
Ids of Elements that have caused the failure.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailureMessageAccessor has not been properly initialized.
Since:
2011

Autodesk.Revit.DB.FailureMessageAccessor.GetDefaultResolutionCaption
Retrieves the caption of default resolution of the failure.
Returns:
The caption of default resolution of the failure.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailureMessageAccessor has not been properly initialized.
Since:
2011

Autodesk.Revit.DB.FailureMessageAccessor.HasResolutionOfType(Autodesk.Revit.DB.FailureResolutionType)
Checks if failure has a resolution of a given type.
type:
The type of resolution.
Returns:
True if failure has a resolution of a given type, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailureMessageAccessor has not been properly initialized.
Since:
2011

Autodesk.Revit.DB.FailureMessageAccessor.HasResolutions
Checks if the failure has any resolutions.
Returns:
True if the failure has any resolutions, false otherwise.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailureMessageAccessor has not been properly initialized.
Since:
2011

Autodesk.Revit.DB.FailureMessageAccessor.GetDescriptionText
Retrieves the description of the failure.
Returns:
The description text.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailureMessageAccessor has not been properly initialized.
Since:
2011

Autodesk.Revit.DB.FailureMessageAccessor.GetSeverity
Retrieves the severity of the failure.
Returns:
The severity of the failure.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailureMessageAccessor has not been properly initialized.
Since:
2011

Autodesk.Revit.DB.FailureMessageAccessor.GetFailureDefinitionId
Retrieves the Id of the FailureDefinition of the failure.
Returns:
The Id of the FailureDefinition of the failure.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailureMessageAccessor has not been properly initialized.
Since:
2011

Autodesk.Revit.DB.FailureMessageAccessor.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.FailureMessageAccessor
Restricted accessor for FailureMessage.
Remarks:
Provides access to a FailureMessage stored in a Document. Reading of the information from the FailureMessage is allowed,
changing of information is generally not allowed, except setting of the current resolution type.
Since:
2011